app/views/users/show.html.erb


<% @user.pictures.each do |picture| %>
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."user_id" = $1  [["user_id", 1]]