app/views/pictures/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "picture_categories" ON "categories"."id" = "picture_categories"."category_id" WHERE "picture_categories"."picture_id" = $1  [["picture_id", 1]]
---
<ul>
  <% @picture.categories.each do |category| %>

SELECT  "picture_categories".* FROM "picture_categories" WHERE "picture_categories"."picture_id" = $1 AND "picture_categories"."category_id" = $2 LIMIT $3  [["picture_id", 1], ["category_id", 1], ["LIMIT", 1]]
---
      <% if logged_in? && user_authorized? %>
        <%= form_tag "/picture-categories/#{PictureCategory.find_by( picture_id: @picture.id, category_id: category.id).id}", method: "delete" do %>

SELECT "tags".* FROM "tags" INNER JOIN "picture_tags" ON "tags"."id" = "picture_tags"."tag_id" WHERE "picture_tags"."picture_id" = $1  [["picture_id", 16]]
---
<ul>
  <% @picture.tags.each do |tag| %>

SELECT  "picture_tags".* FROM "picture_tags" WHERE "picture_tags"."picture_id" = $1 AND "picture_tags"."tag_id" = $2 LIMIT $3  [["picture_id", 17], ["tag_id", 1], ["LIMIT", 1]]
---
      <% if logged_in? && user_authorized? %>
        <%= form_tag "/picture-tags/#{PictureTag.find_by( picture_id: @picture.id, tag_id: tag.id).id}", method: "delete" do %>