app/controllers/pictures_controller.rb

  def create
    @picture = Picture.new( picture_params )
    categories = params.require( :categories )
    categories = categories.split(",")
    categories.map! do |category|
      Category.find_or_create_by( name: category.strip )
    end
    @picture.categories = categories
    @picture.user = current_user
    if @picture.save
---
INSERT INTO "categories" ("name") VALUES ($1) RETURNING "id"  [["name", "test"]]
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "test"], ["LIMIT", 1]]
INSERT INTO "picture_categories" ("picture_id", "category_id") VALUES ($1, $2) RETURNING "id"  [["picture_id", 1], ["category_id", 1]]
INSERT INTO "pictures" ("user_id", "name", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["name", "Test"], ["image_file_name", "wizard.jpg"], ["image_content_type", "image/jpeg"], ["image_file_size", 28164], ["image_updated_at", 2017-04-19 18:54:11 UTC]]

  def index
    @pictures = Picture.all
---
SELECT "pictures".* FROM "pictures"

  def set_picture
    @picture = Picture.find( params[:id] )
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]