app/controllers/pictures_controller.rb

SELECT "categories".* FROM "categories"
---
  def set_categories
    @categories = Category.all