app/controllers/sessions_controller.rb

  def create
    @user = User.find_by( params.permit( :username ) )
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "mark"], ["LIMIT", 1]]