app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest") VALUES ($1, $2) RETURNING "id"  [["username", "mark"], ["password_digest", "$2a$10$zXHS1nwOx2kBSONhIdIK2.ART/tkuA9tPR.vZPHQDbuqXmuoQ7HDm"]]
---
  def create
    @user = User.new( user_params )
    if @user.save